# Задача 1
# Выведите на экран надпись"Nothing will work unless you do" на разных строках двумя способами используя функцию print

#1 Вариант
print("Nothing will work\nunless you do")

#2 вариант
print("Nothing will work")
print()
print("unless you do")


# Задача 2
# Выведите на экран надпись " Anyone who stops learning s old, whether at twenty or eighty" Henry Ford на разных строках.

print( "Anyone who\n        stops\n        earning s old,\n whether at twenty or eighty \n   Henry Ford")










